backend/app/views/favorite_lists/_form.html.haml

SELECT `spells`.* FROM `spells`
---
  =f.input :name
  - Spell.all.each do |spell|