backend/app/controllers/battles_controller.rb

  def index
    @battles = Battle.all
---
SELECT `battles`.* FROM `battles`

  def create
    @battle = Battle.create battle_params
    @spells = []
    params[:battle][:challenger_spells].each do |spell|
      # p spell

      @weapon = @battle.weapons.create(
        spell_id: spell[:id],
        user_id: params[:battle][:challenger_id]
      )
---
INSERT INTO `battles` (`challengee_hp`, `challengee_id`, `challenger_hp`, `challenger_id`, `created_at`, `updated_at`, `workflow_state`) VALUES (50, 2, 50, 1, '2014-08-24 00:06:47', '2014-08-24 00:06:47', 'challenged')
INSERT INTO `weapons` (`battle_id`, `created_at`, `spell_id`, `updated_at`, `user_id`) VALUES (19, '2014-08-23 21:09:38', 3, '2014-08-23 21:09:38', 1)

  def detect_challenge
    @user = User.find(params[:user_id])
    @battle = Battle.where(workflow_state: 'challenged', challengee_id: @user.id).first
---
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 4 LIMIT 1
SELECT  `battles`.* FROM `battles`  WHERE `battles`.`workflow_state` = 'challenged' AND `battles`.`challengee_id` = 4  ORDER BY `battles`.`id` ASC LIMIT 1

  def update_battle
    @challenger_spells = @battle.weapons.map(&:spell)
    @challengee_spells = []
    params[:challengee_spells].each do |spell|
      # p spell

      @weapon = @battle.weapons.create(
        spell_id: spell[:id],
        user_id: params[:battle][:challengee_id]
      )
---
SELECT `weapons`.* FROM `weapons`  WHERE `weapons`.`battle_id` = 5
INSERT INTO `weapons` (`battle_id`, `created_at`, `spell_id`, `updated_at`, `user_id`) VALUES (5, '2014-08-23 22:55:34', 5, '2014-08-23 22:55:34', 2)

  def get_challenge_data
    @challenger_spells = @battle.weapons.where(user_id: @battle.challenger_id).map(&:spell)
---
SELECT `weapons`.* FROM `weapons`  WHERE `weapons`.`battle_id` = 5 AND `weapons`.`user_id` = 1

  def find_battle
    @battle = Battle.find params[:id]
---
SELECT  `battles`.* FROM `battles`  WHERE `battles`.`id` = 5 LIMIT 1