backend/app/controllers/favorite_lists_controller.rb

  def index
    @list = FavoriteList.all
---
SELECT `favorite_lists`.* FROM `favorite_lists`

  def create
    @list = FavoriteList.create list_params
---
INSERT INTO `favorite_lists` (`created_at`, `name`, `updated_at`) VALUES ('2014-08-23 15:56:29', 'test list', '2014-08-23 15:56:29')
INSERT INTO `favorites` (`created_at`, `favorite_list_id`, `spell_id`, `updated_at`) VALUES ('2014-08-23 17:25:08', 7, 4, '2014-08-23 17:25:08')