backend/app/controllers/omniauth_callbacks_controller.rb

  def twitter
    auth = request.env["omniauth.auth"]
    user = User.find_by_provider_and_uid(auth["provider"], auth["uid"]) || User.create_with_omniauth(auth)
---
INSERT INTO `users` (`created_at`, `email`, `encrypted_password`, `name`, `provider`, `uid`, `updated_at`) VALUES ('2014-08-23 15:53:57', 'change@me-40869925-twitter.com', '$2a$10$4NX.HvDpcHQniNlNi2pjD./p3OzfCbNES/LI5k9PUueCyUgWwTcfi', 'Nick Bucciarelli', 'twitter', '40869925', '2014-08-23 15:53:57')
SELECT  `users`.* FROM `users`  WHERE `users`.`provider` = 'twitter' AND `users`.`uid` = '40869925' LIMIT 1