backend/app/controllers/spells_controller.rb

SELECT `spells`.* FROM `spells`
---
  def index
    @spells = Spell.all

SELECT  `battles`.* FROM `battles`  WHERE `battles`.`id` = 1 LIMIT 1
SELECT  `spells`.* FROM `spells`  WHERE `spells`.`id` = 3 LIMIT 1
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 2 LIMIT 1
UPDATE `battles` SET `challenger_hp` = 35, `updated_at` = '2014-08-24 00:19:48' WHERE `battles`.`id` = 1
---
  def cast_spell
    @battle = Battle.find params[:battle_id]
    @spell = Spell.find params[:id]
    # @battle.spells.where(user_id: params[:user_id], spell: params[:id])
    @user = User.find params[:user_id]
    p @user
    if @battle.challenger == @user
      @battle.challenger_hp -= @spell.damage_count
      @battle.save