backend/app/controllers/users_controller.rb

  def create
    @user = User.find_by_email(params[:login_info][:email])
    unless @user
      @user = User.new user_params
      @user.save!(validate: false)
---
SELECT  `users`.* FROM `users`  WHERE `users`.`email` = 'nick@nick.com' LIMIT 1
INSERT INTO `users` (`created_at`, `email`, `encrypted_password`, `updated_at`) VALUES ('2014-08-23 22:22:08', 'fgfe', '$2a$10$aujegsI8BCBBvwo9vA6iVeWOAUj0ZrwDpiXMBPw5BgIKVSQO9tygG', '2014-08-23 22:22:08')